vane_diffuser/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "(p|pFinal|pcorr.*)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|UFinal|k|kFinal|omega|omegaFinal|epsilon|epsilonFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor   true;
    nOuterCorrectors    20;
    nCorrectors         4;
    nNonOrthogonalCorrectors 2;

    //correctPhi          true;
    ddtCorr             true;

    residualControl
    {
        U
        {
                tolerance  1e-5;
                relTol      0;
        }
        p
        {
                tolerance  1e-4;
                relTol      0;
        }

        "(k|epsilon|omega)"
        {
                tolerance  1e-5;
                relTol      0;
        }
    }
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        U                   1e-5;
        p                   1e-4;
        "(k|epsilon|omega)" 1e-5;
    }
}

relaxationFactors
{
    /*fields
    {
        p                   0.25;
        U                   0.25;
        "(k|omega|epsilon)" 0.25;
    }*/
    equations
    {
        U                   0.25;
        "(k|omega|epsilon)" 0.25;
    }
}

// ************************************************************************* //
