vane_diffuser/system/meshParameters
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
xin   0;
xout   0.22;
yu   0.178;
yl   -0.178;
hm   100;
vm   162;
